www/frontend/views/layouts/main.php

$helper = new MenuHelper();
$mobileHelper = new MobileMenuHelper();
$socials = Socials::getDb()->cache(function () {
    return Socials::find()->having(['status' => 1])->orderBy('sort')->all();
}, Yii::$app->params['cacheTime']);
$email = Contacts::getDb()->cache(function () {
    return Contacts::find()->having(['status' => 1,'type'=>'email'])->orderBy('sort')->one();
}, Yii::$app->params['cacheTime']);
$phone = Contacts::getDb()->cache(function () {
    return Contacts::find()->having(['status' => 1,'type'=>'phone'])->orderBy('sort')->one();
---
SELECT * FROM `bhm_socials` HAVING `status`=1 ORDER BY `sort`
SELECT * FROM `bhm_contacts` HAVING (`status`=1) AND (`type`='email') ORDER BY `sort`
SELECT * FROM `bhm_contacts` HAVING (`status`=1) AND (`type`='phone') ORDER BY `sort`