www/backend/views/layouts/left.php

SELECT * FROM `bhm_gallery_categories` WHERE `status`=1 ORDER BY `sort`
---

$user = Yii::$app->user->identity;

$categories = GalleryCategories::find()->andWhere(['status' => 1])->orderBy('sort')->all();

SELECT * FROM `bhm_stockists_categories` WHERE `status`=1 ORDER BY `sort`
---
        'url' => ['gallery-items/index', 'slug' => $category->slug]];
}

$stockCategories = StockistsCategories::find()->andWhere(['status' => 1])->orderBy('sort')->all();