www/frontend/controllers/CatalogController.php

    public function actionProduct($slug)
    {
        if (!$product = Product::findOne(['slug' => $slug])) {
            throw new NotFoundHttpException(Yii::t('app', 'The requested page does not exist.'));
        }
        $this->setMeta($product->meta->getTitle() ?: $product->name, $product->meta->getDescription(), $product->meta->getKeywords());
        $sizes = SizeGuide::getDb()->cache(function () {
            return SizeGuide::find()->andWhere(['status' => 1])->orderBy('sort')->all();
---
SELECT * FROM `bhm_size_guide` WHERE `status`=1 ORDER BY `sort`