www/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $this->setMetAndGetHeader('index');
        if (!Yii::$app->request->cookies->get('agreement')) {
            Yii::$app->session->setFlash('info',
                '<p>' . Yii::t('app', 'We use cookies to offer you a better browsing experience, analyse site traffic, personalise content.')
                . ' ' . Html::a(Yii::t('app', 'Read about how we use cookies.'), ['site/cookie-policy'])
                . ' ' . Yii::t('app', 'If you continue to use this site, you consent to our use of cookies.') . '</p>'
                . '   ' . Html::a('Ok', ['site/agreement'], ['class' => 'btn black']));
        }
        $indexLinks = IndexLinks::find()->having(['status' => 1])->orderBy('sort')->all();
        $link = IndexLink::findOne(1);
        $file = Slider::findOne(1);
---
SELECT * FROM `bhm_index_links` HAVING `status`=1 ORDER BY `sort`
SELECT * FROM `bhm_index_link` WHERE `id`=1
SELECT * FROM `bhm_slider` WHERE `id`=1

    public function actionAbout()
    {
        $this->setMetAndGetHeader('about');
        $module = Modules::getDb()->cache(function () {
            return Modules::findOne(1);
---
SELECT * FROM `bhm_modules` WHERE `id`=1

    public function actionGalleries()
    {
        $this->setMetAndGetHeader('gallery');
        $galleries = GalleryCategories::getDb()->cache(function () {
            return GalleryCategories::find()->having(['status' => 1])->orderBy('sort')->all();
---
SELECT * FROM `bhm_gallery_categories` HAVING `status`=1 ORDER BY `sort`

    public function actionStockists()
    {
        $this->setMetAndGetHeader('stockists');
        $regions = StockistsCategories::getDb()->cache(function () {
            return StockistsCategories::find()->having(['status' => 1])->with('activeStockistsItems')->orderBy('sort')->all();
---
SELECT * FROM `bhm_stockists_items` WHERE `category_id`=1 HAVING `status`=1 ORDER BY `sort`
SELECT * FROM `bhm_stockists_categories` HAVING `status`=1 ORDER BY `sort`

    public function actionPress()
    {
        $this->setMetAndGetHeader('press');
        $press = Press::getDb()->cache(function () {
            return Press::find()->having(['status' => 1])->orderBy('sort')->all();
---
SELECT * FROM `bhm_press` HAVING `status`=1 ORDER BY `sort`