www/backend/models/LoginForm.php

SELECT * FROM `bhm_user` WHERE `email`='admin@mail.com'
---
    public function getUser()
    {
        if ($this->user === false) {
            $this->user = User::findOne(['email' => $this->email]);