www/backend/controllers/IndexLinkController.php

    protected function findModel($id)
    {
        if (($model = IndexLink::findOne($id)) !== null) {
---
SELECT * FROM `bhm_index_link` WHERE `id`='1'