www/backend/controllers/ModulesController.php

SELECT * FROM `bhm_modules` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Modules::findOne($id)) !== null) {