www/backend/controllers/SeoController.php

    protected function findModel($page)
    {
        if (!$model = Seo::findOne(['page' => $page])) {
---
SELECT * FROM `bhm_seo` WHERE `page`='about'