www/backend/controllers/SliderController.php

SELECT * FROM `bhm_slider` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Slider::findOne($id)) !== null) {