www/backend/views/orders/index.php

SELECT * FROM `bhm_order_items` WHERE `order_id`=382
---
                        'format' => 'raw',
                        'value' => function (Orders $data) {
                            $string = '';
                            foreach ($data->orderItems as $item) {