www/frontend/components/FrontendController.php

    protected function setMetAndGetHeader($action)
    {
        $seo = Seo::getDb()->cache(function () use ($action) {
            return Seo::findOne(['page' => $action]);
---
SELECT * FROM `bhm_seo` WHERE `page`='index'