www/frontend/components/MenuHelper.php

    protected function getBanners($cat){
        $banners = IndexLinks::getDb()->cache(function () {
            return IndexLinks::find()->all();
---
SELECT * FROM `bhm_index_links`