www/common/models/User.php

SELECT * FROM `bhm_user` WHERE (`email`='admin@mail.com') AND (`role`='admin')
---
    public static function isUserAdmin($email)
    {
        if (static::findOne(['email' => $email, 'role' => self::ROLE_ADMIN])) {